#+TITLE: Readme for CaPPA

CaPPA is a derivative of MELPA for scientific preprints. The idea is we use the recipes for preprint repositories instead, and serve them.

To build CaPPA run these commands in this directory.

#+BEGIN_SRC sh
make
make sync
make deploy
#+END_SRC

Roughly this does the following:
1. Updates all the repositories listed in the [[./recipes]] directory.
2. Generates web pages and data files for each repository.
3. Synchronizes the generated files to the Cappa repository.



* About this build
The CaPPA derivative of MELPA is on the cappa branch.

* Archived notes			  :archive:
** Package page

 Goal: create an html page describing a package (preprint)

 We need to operate off this list so we can generate links to the package from the version.

 Here are the keys
 #+BEGIN_SRC emacs-lisp
(-slice (package-build--archive-alist-for-json) 0 nil 2)
 #+END_SRC

 #+RESULTS:
 | :kitchingroup-57 | :kitchingroup-46 | :kitchingroup-43 | :cappa |

 And the values
 #+BEGIN_SRC emacs-lisp
(-slice (package-build--archive-alist-for-json) 1 nil 2)
 #+END_SRC

 #+RESULTS:
 | :ver | (20160131 1005) | :deps | (:cappa (0)) | :desc | preprint http://dx.doi.org/10.1021/acscatal.5b00538. | :type | tar    | :props | ((:authors (John Kitchin . jkitchin@andrew.cmu.edu)) (:maintainer (John Kitchin . jkitchin@andrew.cmu.edu)))                                                    |
 | :ver | (20160131 1003) | :deps | nil          | :desc | preprint for doi:10.1021/ja5015986                   | :type | tar    | :props | ((:authors (John R. Kitchin . jkitchin@andrew.cmu.edu)) (:maintainer (John R. Kitchin . jkitchin@andrew.cmu.edu)) (:url . http://dx.doi.org/10.1021/ja5015986)) |
 | :ver | (20160131 1004) | :deps | (:cappa (0)) | :desc | preprint doi:10.1007/s11244-013-0166-3               | :type | tar    | :props | ((:authors (John Kitchin . jkitchin@andrew.cmu.edu)) (:maintainer (John Kitchin . jkitchin@andrew.cmu.edu)))                                                    |
 | :ver | (20160130 1736) | :deps | nil          | :desc | Catalysis Preprint Archive                           | :type | single | :props | ((:authors (John Kitchin . jkitchin@andrew.cmu.edu)) (:maintainer (John Kitchin . jkitchin@andrew.cmu.edu)))                                                    |

 Here are all the package names.
 #+BEGIN_SRC emacs-lisp
(loop for (key ver type) in

      (loop for key in (-slice (package-build--archive-alist-for-json) 0 nil 2)
	    for data in (-slice (package-build--archive-alist-for-json) 1 nil 2)
	    collect (list key (plist-get data :ver)
			  (plist-get data :type)))
      with link = ""
      do
      ;; convert key to string
      (setq link
	    (format "preprints/%s-%s.%s.%s"
		    (substring (symbol-name key) 1)
		    (nth 0 ver)
		    (nth 1 ver)
		    (if (eq 'single type)
			"el"
		      "tar")))

      collect link)
 #+END_SRC

 #+RESULTS:
 | preprints/kitchingroup-57-20160131.1005.tar | preprints/kitchingroup-46-20160131.1003.tar | preprints/kitchingroup-43-20160131.1004.tar | preprints/cappa-20160130.1736.el |

 I would like to list the contents of the packages we can do that.

 #+BEGIN_SRC emacs-lisp
(with-current-buffer (find-file-noselect "packages/kitchingroup-43-20160131.1004.tar")
  (buffer-string))
 #+END_SRC

 #+RESULTS:
 #+begin_example
 drwxr-xr-x jkitchin/staff         0 kitchingroup-43-20160131.1004/
 drwxr-xr-x jkitchin/staff         0 kitchingroup-43-20160131.1004/figures/
 -rw-r--r-- jkitchin/staff    186892 kitchingroup-43-20160131.1004/figures/fig1.eps
 -rw-r--r-- jkitchin/staff     88833 kitchingroup-43-20160131.1004/figures/fig1.pdf
 -rw-r--r-- jkitchin/staff    129768 kitchingroup-43-20160131.1004/figures/fig1.png
 -rw-r--r-- jkitchin/staff    273073 kitchingroup-43-20160131.1004/figures/fig2.eps
 -rw-r--r-- jkitchin/staff    139698 kitchingroup-43-20160131.1004/figures/fig2.pdf
 -rw-r--r-- jkitchin/staff    266863 kitchingroup-43-20160131.1004/figures/fig2.png
 -rw-r--r-- jkitchin/staff    167960 kitchingroup-43-20160131.1004/figures/fig3.eps
 -rw-r--r-- jkitchin/staff     75311 kitchingroup-43-20160131.1004/figures/fig3.pdf
 -rw-r--r-- jkitchin/staff    140877 kitchingroup-43-20160131.1004/figures/fig3.png
 -rw-r--r-- jkitchin/staff    410862 kitchingroup-43-20160131.1004/figures/fig4.eps
 -rw-r--r-- jkitchin/staff    158292 kitchingroup-43-20160131.1004/figures/fig4.pdf
 -rw-r--r-- jkitchin/staff    162265 kitchingroup-43-20160131.1004/figures/fig4.png
 -rw-r--r-- jkitchin/staff    255085 kitchingroup-43-20160131.1004/figures/fig5.eps
 -rw-r--r-- jkitchin/staff    111185 kitchingroup-43-20160131.1004/figures/fig5.pdf
 -rw-r--r-- jkitchin/staff     96835 kitchingroup-43-20160131.1004/figures/fig5.png
 -rw-r--r-- jkitchin/staff    206331 kitchingroup-43-20160131.1004/figures/fig6.eps
 -rw-r--r-- jkitchin/staff     99547 kitchingroup-43-20160131.1004/figures/fig6.pdf
 -rw-r--r-- jkitchin/staff    158377 kitchingroup-43-20160131.1004/figures/fig6.png
 -rw-r--r-- jkitchin/staff    169507 kitchingroup-43-20160131.1004/figures/fig7.eps
 -rw-r--r-- jkitchin/staff     75905 kitchingroup-43-20160131.1004/figures/fig7.pdf
 -rw-r--r-- jkitchin/staff    153303 kitchingroup-43-20160131.1004/figures/fig7.png
 -rw-r--r-- jkitchin/staff    175579 kitchingroup-43-20160131.1004/figures/fig8.eps
 -rw-r--r-- jkitchin/staff     69173 kitchingroup-43-20160131.1004/figures/fig8.pdf
 -rw-r--r-- jkitchin/staff     84890 kitchingroup-43-20160131.1004/figures/fig8.png
 -rw-r--r-- jkitchin/staff       284 kitchingroup-43-20160131.1004/kitchingroup-43-pkg.el
 -rw-r--r-- jkitchin/staff      2964 kitchingroup-43-20160131.1004/kitchingroup-43.el
 -rw-r--r-- jkitchin/staff      1063 kitchingroup-43-20160131.1004/README.org
 -rw-r--r-- jkitchin/staff     30142 kitchingroup-43-20160131.1004/spmpsci.bst
 -rw-r--r-- jkitchin/staff    818254 kitchingroup-43-20160131.1004/supporting-information.org
 -rw-r--r-- jkitchin/staff   1515771 kitchingroup-43-20160131.1004/supporting-information.pdf
 -rw-r--r-- jkitchin/staff     34506 kitchingroup-43-20160131.1004/tpd-scaling.bib
 -rw-r--r-- jkitchin/staff     53697 kitchingroup-43-20160131.1004/tpd-scaling.org
 -rw-r--r-- jkitchin/staff   1035919 kitchingroup-43-20160131.1004/tpd-scaling.pdf
 drwxr-xr-x jkitchin/staff         0 kitchingroup-43-20160131.1004/xls/
 -rw-r--r-- jkitchin/staff     28672 kitchingroup-43-20160131.1004/xls/tpd1.xls
 -rw-r--r-- jkitchin/staff     28672 kitchingroup-43-20160131.1004/xls/tpd10.xls
 -rw-r--r-- jkitchin/staff     28672 kitchingroup-43-20160131.1004/xls/tpd11.xls
 -rw-r--r-- jkitchin/staff     28672 kitchingroup-43-20160131.1004/xls/tpd12.xls
 -rw-r--r-- jkitchin/staff     28672 kitchingroup-43-20160131.1004/xls/tpd13.xls
 -rw-r--r-- jkitchin/staff     28672 kitchingroup-43-20160131.1004/xls/tpd14.xls
 -rw-r--r-- jkitchin/staff     28672 kitchingroup-43-20160131.1004/xls/tpd15.xls
 -rw-r--r-- jkitchin/staff     28672 kitchingroup-43-20160131.1004/xls/tpd16.xls
 -rw-r--r-- jkitchin/staff     28672 kitchingroup-43-20160131.1004/xls/tpd17.xls
 -rw-r--r-- jkitchin/staff     28672 kitchingroup-43-20160131.1004/xls/tpd18.xls
 -rw-r--r-- jkitchin/staff     28672 kitchingroup-43-20160131.1004/xls/tpd19.xls
 -rw-r--r-- jkitchin/staff     28672 kitchingroup-43-20160131.1004/xls/tpd2.xls
 -rw-r--r-- jkitchin/staff     28672 kitchingroup-43-20160131.1004/xls/tpd20.xls
 -rw-r--r-- jkitchin/staff     28672 kitchingroup-43-20160131.1004/xls/tpd21.xls
 -rw-r--r-- jkitchin/staff     28672 kitchingroup-43-20160131.1004/xls/tpd3.xls
 -rw-r--r-- jkitchin/staff     28672 kitchingroup-43-20160131.1004/xls/tpd4.xls
 -rw-r--r-- jkitchin/staff     28672 kitchingroup-43-20160131.1004/xls/tpd5.xls
 -rw-r--r-- jkitchin/staff     28672 kitchingroup-43-20160131.1004/xls/tpd6.xls
 -rw-r--r-- jkitchin/staff     28672 kitchingroup-43-20160131.1004/xls/tpd7.xls
 -rw-r--r-- jkitchin/staff     28672 kitchingroup-43-20160131.1004/xls/tpd8.xls
 -rw-r--r-- jkitchin/staff     28672 kitchingroup-43-20160131.1004/xls/tpd9.xls
 #+end_example

 Here is some minimal info.
 #+BEGIN_SRC emacs-lisp
(defun cappa-package-html (key data)
  "Create an html page for KEY and DATA.
KEY is :label
DATA is (plist-get (package-build--archive-alist-for-json) key)."
  ;; first, gather information.
  (let* ((package (substring (symbol-name key) 1))
	 (pkg-el-file (expand-file-name
		       (format "%s/%s.el" package package)
		       package-build-working-dir))
	 (type (plist-get data :type))
	 (ver (plist-get data :ver))
	 (pkg-base (format "%s-%s.%s"
			   package
			   (nth 0 ver)
			   (nth 1 ver)))
	 (pkg-file (format "%s.%s" pkg-base
			   (if (eq 'single type)
			       "el"
			     "tar")))
	 (html (format "%s/%s.html" "html/packages" package))
	 author doi desc commentary)

    (with-current-buffer (find-file-noselect pkg-el-file)
      (setq author (lm-header "author")
	    doi (or (lm-header "doi") "")
	    desc (package-desc-summary (package-buffer-info))
	    commentary (or (lm-commentary) "")))

    (with-temp-file html
      (insert
       (s-format
     "<html>
<body>

<h1>${desc}</h1>

${author}<br>

<a href=\"./preprints/${pkg-file}\">${pkg-file}</a>

<pre>${commentary}</pre>

<pre>
Contents:
${contents}
</pre>

</body></html>"

     'aget
     `(("desc" . ,desc)
       ("author" . ,author)
       ("pkg-file" . ,pkg-file)
       ("commentary" . ,commentary)
       ("contents" . ,(if (eq type 'single)
			  ;; el-file
			  pkg-file
			;; tar-file
			(with-current-buffer
			    (find-file-noselect
			     (format "packages/%s" pkg-file))
			  (buffer-string))))))))))


(let* ((e (package-build--archive-alist-for-json))
       (key (nth 0 e))
       (data (nth 1 e)))
  (cappa-package-html key data))
 #+END_SRC

 #+RESULTS:

** Known bugs
 There is a bug in the melpa/package code that is presently preventing the html from properly building. It is because :maintainer is not serializing correctly.

 see https://github.com/milkypostman/melpa/issues/3548


 #+BEGIN_SRC emacs-lisp :results code
(package-build--archive-alist-for-json)
 #+END_SRC

 #+RESULTS:
 #+BEGIN_SRC emacs-lisp
(:kitchingroup-57
 (:ver
  (20160130 1223)
  :deps
  (:cappa
   (0))
  :desc "preprint http://dx.doi.org/10.1021/acscatal.5b00538." :type tar :props
  ((:authors
    ("John Kitchin" . "jkitchin@andrew.cmu.edu"))
   (:maintainer "John Kitchin" . "jkitchin@andrew.cmu.edu")))
 :kitchingroup-43
 (:ver
  (20160130 1150)
  :deps
  (:cappa
   (0))
  :desc "preprint doi:10.1007/s11244-013-0166-3" :type tar :props
  ((:authors
    ("John Kitchin" . "jkitchin@andrew.cmu.edu"))
   (:maintainer "John Kitchin" . "jkitchin@andrew.cmu.edu")))
 :cappa
 (:ver
  (20160130 1058)
  :deps nil :desc "Catalysis Preprint Archive" :type single :props
  ((:authors
    ("John Kitchin" . "jkitchin@andrew.cmu.edu"))
   (:maintainer "John Kitchin" . "jkitchin@andrew.cmu.edu"))))
 #+END_SRC

 #+BEGIN_SRC emacs-lisp :results code
(package-build-archive-alist)
 #+END_SRC

 #+RESULTS:
 #+BEGIN_SRC emacs-lisp
((kitchingroup-57 .
		  [(20160130 1457)
		   ((cappa
		     (0)))
		   "preprint http://dx.doi.org/10.1021/acscatal.5b00538." tar
		   ((:authors
		     ("John Kitchin" . "jkitchin@andrew.cmu.edu"))
		    (:maintainer "John Kitchin" . "jkitchin@andrew.cmu.edu"))])
 (kitchingroup-43 .
		  [(20160130 1457)
		   ((cappa
		     (0)))
		   "preprint doi:10.1007/s11244-013-0166-3" tar
		   ((:authors
		     ("John Kitchin" . "jkitchin@andrew.cmu.edu"))
		    (:maintainer "John Kitchin" . "jkitchin@andrew.cmu.edu"))])
 (cappa .
	[(20160130 1058)
	 nil "Catalysis Preprint Archive" single
	 ((:authors
	   ("John Kitchin" . "jkitchin@andrew.cmu.edu"))
	  (:maintainer "John Kitchin" . "jkitchin@andrew.cmu.edu"))]))
 #+END_SRC

 It looks like archive contents has the bad maintainer lines.

 This reads the entry files, and they are the source of the bad maintainer files.
 #+BEGIN_SRC emacs-lisp :results code
(package-build--archive-entries)
 #+END_SRC

 #+RESULTS:
 #+BEGIN_SRC emacs-lisp
((kitchingroup-57 .
		  [(20160130 1457)
		   ((cappa
		     (0)))
		   "preprint http://dx.doi.org/10.1021/acscatal.5b00538." tar
		   ((:authors
		     ("John Kitchin" . "jkitchin@andrew.cmu.edu"))
		    (:maintainer "John Kitchin" . "jkitchin@andrew.cmu.edu"))])
 (kitchingroup-46 .
		  [(20160131 704)
		   nil "preprint for doi:10.1021/ja5015986" tar
		   ((:authors
		     ("Ethan L. Demeter, Shayna L. Hilburg, Newell R. Washburn, Terrence J. Collins and John R. Kitchin" . "jkitchin@andrew.cmu.edu"))
		    (:maintainer "Ethan L. Demeter, Shayna L. Hilburg, Newell R. Washburn, Terrence J. Collins and John R. Kitchin" . "jkitchin@andrew.cmu.edu")
		    (:url . "http://dx.doi.org/10.1021/ja5015986"))])
 (kitchingroup-43 .
		  [(20160130 1457)
		   ((cappa
		     (0)))
		   "preprint doi:10.1007/s11244-013-0166-3" tar
		   ((:authors
		     ("John Kitchin" . "jkitchin@andrew.cmu.edu"))
		    (:maintainer "John Kitchin" . "jkitchin@andrew.cmu.edu"))])
 (cappa .
	[(20160130 1058)
	 nil "Catalysis Preprint Archive" single
	 ((:authors
	   ("John Kitchin" . "jkitchin@andrew.cmu.edu"))
	  (:maintainer "John Kitchin" . "jkitchin@andrew.cmu.edu"))]))
 #+END_SRC

*** Checking a build
 #+BEGIN_SRC emacs-lisp
(load-file "package-build.el")
(let ((package-build-stable nil)
      (package-build-write-melpa-badge-images t)
      (package-build-archive-dir
       (expand-file-name "packages" package-build--this-dir)))
  (package-build-archive 'kitchingroup-43))
 #+END_SRC

 #+RESULTS:
 | kitchingroup-43 | 20160130.1457 |




** Checking for bug
 #+BEGIN_SRC emacs-lisp :results raw
(progn (find-file "working/kitchingroup-43/kitchingroup-43.el")
(package-build--package-buffer-info-vec))
 #+END_SRC



 #+BEGIN_SRC emacs-lisp
(load-file "package-build.el")
(package-build--archive-alist-for-json)
 #+END_SRC

 #+RESULTS:
 | :kitchingroup-9 | (:ver (20160131 1904) :deps nil :desc preprint :type tar :props ((:authors (John Kitchin . jkitchin@andrew.cmu.edu)) (:maintainer (John Kitchin . jkitchin@andrew.cmu.edu)))) | :kitchingroup-7 | (:ver (20160131 1850) :deps nil :desc CaPPA preprint for doi:10.1063/1.1737365 :type tar :props ((:authors (John Kitchin . jkitchin@andrew.cmu.edu)) (:maintainer (John Kitchin . jkitchin@andrew.cmu.edu)))) | :kitchingroup-62 | (:ver (20160131 2149) :deps nil :desc CaPPA preprint for doi: :type tar :props ((:authors (John Kitchin . jkitchin@andrew.cmu.edu)) (:maintainer (John Kitchin . jkitchin@andrew.cmu.edu)))) | :kitchingroup-60 | (:ver (20160201 652) :deps nil :desc CaPPA preprint for doi:10.1016/j.susc.2015.10.001 :type tar :props ((:authors (Hari Thirumalai)) (:maintainer (Hari Thirumalai)))) | :kitchingroup-57 | (:ver (20160131 1841) :deps (:cappa (0)) :desc preprint http://dx.doi.org/10.1021/acscatal.5b00538. :type tar :props ((:authors (John Kitchin . jkitchin@andrew.cmu.edu)) (:maintainer (John Kitchin . jkitchin@andrew.cmu.edu)))) | :kitchingroup-56 | (:ver (20160201 842) :deps nil :desc CaPPA preprint for doi: :type tar :props ((:authors (John Kitchin . jkitchin@andrew.cmu.edu)) (:maintainer (John Kitchin . jkitchin@andrew.cmu.edu)))) | :kitchingroup-46 | (:ver (20160131 1840) :deps nil :desc preprint for doi:10.1021/ja5015986 :type tar :props ((:authors (John R. Kitchin . jkitchin@andrew.cmu.edu)) (:maintainer (John R. Kitchin . jkitchin@andrew.cmu.edu)) (:url . http://dx.doi.org/10.1021/ja5015986))) | :kitchingroup-43 | (:ver (20160131 1838) :deps (:cappa (0)) :desc preprint doi:10.1007/s11244-013-0166-3 :type tar :props ((:authors (Spencer D. Miller)) (:maintainer (Spencer D. Miller)) (:url . http://link.springer.com/article/10.1007%2Fs11244-013-0166-3))) | :cappa | (:ver (20160201 1345) :deps nil :desc Catalysis Preprint Archive :type single :props ((:authors (John Kitchin . jkitchin@andrew.cmu.edu)) (:maintainer (John Kitchin . jkitchin@andrew.cmu.edu)))) |


 emacs --no-site-file --batch -l package-build.el --eval '(let ((package-build-stable nil) (package-build-archive-dir (expand-file-name "./packages/" package-build--this-dir))) (package-build-archive-alist-as-json "html/archive.json"))'
 Wrong type argument: listp, "jkitchin@andrew.cmu.edu"

 #+BEGIN_SRC emacs-lisp
(let ((package-build-stable nil)
      (package-build-archive-dir (expand-file-name "./packages/" package-build--this-dir)))
  (package-build-archive-alist-as-json "html/archive.json"))
 #+END_SRC


 #+BEGIN_SRC emacs-lisp
(json-encode (package-build--archive-alist-for-json))
 #+END_SRC

 #+RESULTS:
 : {"kitchingroup-9":{"ver":[20160131,1904],"deps":null,"desc":"preprint","type":"tar","props":{"authors":{"John Kitchin":"jkitchin@andrew.cmu.edu"},"maintainer":{"John Kitchin":"jkitchin@andrew.cmu.edu"}}},"kitchingroup-7":{"ver":[20160131,1850],"deps":null,"desc":"CaPPA preprint for doi:10.1063/1.1737365","type":"tar","props":{"authors":{"John Kitchin":"jkitchin@andrew.cmu.edu"},"maintainer":{"John Kitchin":"jkitchin@andrew.cmu.edu"}}},"kitchingroup-62":{"ver":[20160131,2149],"deps":null,"desc":"CaPPA preprint for doi:","type":"tar","props":{"authors":{"John Kitchin":"jkitchin@andrew.cmu.edu"},"maintainer":{"John Kitchin":"jkitchin@andrew.cmu.edu"}}},"kitchingroup-60":{"ver":[20160201,652],"deps":null,"desc":"CaPPA preprint for doi:10.1016/j.susc.2015.10.001","type":"tar","props":{"authors":{"Hari Thirumalai":null},"maintainer":{"Hari Thirumalai":null}}},"kitchingroup-57":{"ver":[20160131,1841],"deps":{"cappa":[0]},"desc":"preprint http://dx.doi.org/10.1021/acscatal.5b00538.","type":"tar","props":{"authors":{"John Kitchin":"jkitchin@andrew.cmu.edu"},"maintainer":{"John Kitchin":"jkitchin@andrew.cmu.edu"}}},"kitchingroup-56":{"ver":[20160201,842],"deps":null,"desc":"CaPPA preprint for doi:","type":"tar","props":{"authors":{"John Kitchin":"jkitchin@andrew.cmu.edu"},"maintainer":{"John Kitchin":"jkitchin@andrew.cmu.edu"}}},"kitchingroup-46":{"ver":[20160131,1840],"deps":null,"desc":"preprint for doi:10.1021/ja5015986","type":"tar","props":{"authors":{"John R. Kitchin":"jkitchin@andrew.cmu.edu"},"maintainer":{"John R. Kitchin":"jkitchin@andrew.cmu.edu"},"url":"http://dx.doi.org/10.1021/ja5015986"}},"kitchingroup-43":{"ver":[20160131,1838],"deps":{"cappa":[0]},"desc":"preprint doi:10.1007/s11244-013-0166-3","type":"tar","props":{"authors":{"Spencer D. Miller":null},"maintainer":{"Spencer D. Miller":null},"url":"http://link.springer.com/article/10.1007%2Fs11244-013-0166-3"}},"cappa":{"ver":[20160201,1345],"deps":null,"desc":"Catalysis Preprint Archive","type":"single","props":{"authors":{"John Kitchin":"jkitchin@andrew.cmu.edu"},"maintainer":{"John Kitchin":"jkitchin@andrew.cmu.edu"}}}}

 #+BEGIN_SRC emacs-lisp
(package-build--archive-alist-for-json)
 #+END_SRC

 #+RESULTS:
 | :kitchingroup-9 | (:ver (20160131 1904) :deps nil :desc preprint :type tar :props ((:authors (John Kitchin . jkitchin@andrew.cmu.edu)) (:maintainer (John Kitchin . jkitchin@andrew.cmu.edu)))) | :kitchingroup-7 | (:ver (20160131 1850) :deps nil :desc CaPPA preprint for doi:10.1063/1.1737365 :type tar :props ((:authors (John Kitchin . jkitchin@andrew.cmu.edu)) (:maintainer (John Kitchin . jkitchin@andrew.cmu.edu)))) | :kitchingroup-62 | (:ver (20160131 2149) :deps nil :desc CaPPA preprint for doi: :type tar :props ((:authors (John Kitchin . jkitchin@andrew.cmu.edu)) (:maintainer (John Kitchin . jkitchin@andrew.cmu.edu)))) | :kitchingroup-60 | (:ver (20160201 652) :deps nil :desc CaPPA preprint for doi:10.1016/j.susc.2015.10.001 :type tar :props ((:authors (Hari Thirumalai)) (:maintainer (Hari Thirumalai)))) | :kitchingroup-57 | (:ver (20160131 1841) :deps (:cappa (0)) :desc preprint http://dx.doi.org/10.1021/acscatal.5b00538. :type tar :props ((:authors (John Kitchin . jkitchin@andrew.cmu.edu)) (:maintainer (John Kitchin . jkitchin@andrew.cmu.edu)))) | :kitchingroup-56 | (:ver (20160201 842) :deps nil :desc CaPPA preprint for doi: :type tar :props ((:authors (John Kitchin . jkitchin@andrew.cmu.edu)) (:maintainer (John Kitchin . jkitchin@andrew.cmu.edu)))) | :kitchingroup-46 | (:ver (20160131 1840) :deps nil :desc preprint for doi:10.1021/ja5015986 :type tar :props ((:authors (John R. Kitchin . jkitchin@andrew.cmu.edu)) (:maintainer (John R. Kitchin . jkitchin@andrew.cmu.edu)) (:url . http://dx.doi.org/10.1021/ja5015986))) | :kitchingroup-43 | (:ver (20160131 1838) :deps (:cappa (0)) :desc preprint doi:10.1007/s11244-013-0166-3 :type tar :props ((:authors (Spencer D. Miller)) (:maintainer (Spencer D. Miller)) (:url . http://link.springer.com/article/10.1007%2Fs11244-013-0166-3))) | :cappa | (:ver (20160201 1345) :deps nil :desc Catalysis Preprint Archive :type single :props ((:authors (John Kitchin . jkitchin@andrew.cmu.edu)) (:maintainer (John Kitchin . jkitchin@andrew.cmu.edu)))) |


 #+BEGIN_SRC emacs-lisp
(condition-case nil
    (json-encode '(:maintainer "John" . "my@email.com"))
  (error "error"))
 #+END_SRC

 #+RESULTS:
 : error

 #+BEGIN_SRC emacs-lisp
(condition-case nil
    (json-encode '(:maintainer ("John" . "my@email.com")))
  (error "error"))
 #+END_SRC

 #+RESULTS:
 : error


 #+BEGIN_SRC emacs-lisp
(condition-case nil
    (json-encode '(:maintainer (("John" . "my@email.com"))))
  (error "error"))
 #+END_SRC

 #+RESULTS:
 : {"maintainer":{"John":"my@email.com"}}


 This code does not work.

 #+BEGIN_SRC emacs-lisp
(json-encode-list '(:maintainer ("John" . "my@email.com")))
 #+END_SRC

 #+BEGIN_SRC emacs-lisp
(listp '(:maintainer ("John" . "my@email.com")))
 #+END_SRC

 #+RESULTS:
 : t


 #+BEGIN_SRC emacs-lisp
(json-encode-array '(:maintainer ("John" . "my@email.com")))
 #+END_SRC

** A zenodo builder

 emacs --no-site-file --batch -l package-build.el --eval "(let ((package-build-stable nil) (package-build-write-melpa-badge-images t) (package-build-archive-dir (expand-file-name \"./packages\" package-build--this-dir))) (package-build-archive 'kitchingroup-42))"


 #+BEGIN_SRC emacs-lisp
(package-build-recipe-alist)
 #+END_SRC

 #+RESULTS:
 | cappa           | :fetcher | github | :repo | Catalysis-Preprint-Archive/cappa                            | :files | (:defaults)                                                                                                |
 | kitchingroup-43 | :fetcher | github | :repo | KitchinHUB/kitchingroup-43                                  | :files | (*)                                                                                                        |
 | kitchingroup-44 | :fetcher | git    | :url  | https://jkitchin@bitbucket.org/jkitchin/kitchingroup-44.git | :files | (*)                                                                                                        |
 | kitchingroup-46 | :fetcher | github | :repo | KitchinHUB/kitchingroup-46                                  | :files | (*)                                                                                                        |
 | kitchingroup-47 | :fetcher | gitlab | :repo | jkitchin/kitchingroup-47                                    | :files | (*)                                                                                                        |
 | kitchingroup-50 | :fetcher | github | :repo | KitchinHUB/kitchingroup-50                                  | :files | (*)                                                                                                        |
 | kitchingroup-55 | :fetcher | github | :repo | KitchinHUB/kitchingroup-55                                  | :files | (:defaults README.org manuscript.org manuscript.pdf supporting-information.org supporting-information.pdf) |
 | kitchingroup-56 | :fetcher | github | :repo | KitchinHUB/kitchingroup-56                                  | :files | (*)                                                                                                        |
 | kitchingroup-57 | :fetcher | github | :repo | KitchinHUB/kitchingroup-57                                  | :files | (*)                                                                                                        |
 | kitchingroup-58 | :fetcher | github | :repo | KitchinHUB/kitchingroup-58                                  | :files | (*)                                                                                                        |
 | kitchingroup-60 | :fetcher | github | :repo | KitchinHUB/kitchingroup-60                                  | :files | (*)                                                                                                        |
 | kitchingroup-62 | :fetcher | github | :repo | KitchinHUB/kitchingroup-62                                  | :files | (*)                                                                                                        |
 | kitchingroup-7  | :fetcher | github | :repo | KitchinHUB/kitchingroup-7                                   | :files | (*)                                                                                                        |
 | kitchingroup-9  | :fetcher | github | :repo | KitchinHUB/kitchingroup-9                                   | :files | (*)                                                                                                        |

 #+BEGIN_SRC emacs-lisp
(require 'package-build)
(let ((package-build-stable nil)
      (package-build-write-melpa-badge-images t)
      (package-build-archive-dir (expand-file-name "./packages" package-build--this-dir)))
  (package-build-archive 'kitchingroup-42))
 #+END_SRC

** Figshare builder

 https://figshare.com/articles/2070013/1/citations/dc

 https://figshare.com/articles/2070013/1/citations/nlm

 #+BEGIN_SRC emacs-lisp :results code
(let* ((xml (car (with-current-buffer (url-retrieve-synchronously
				       "https://figshare.com/articles/2070013/1/citations/nlm")
		   (xml-parse-region url-http-end-of-headers (point-max)))))
       (article (car (xml-get-children xml 'article)))
       (front (car (xml-get-children article 'front)))
       (article-meta (car (xml-get-children front 'article-meta)))
       (uris (xml-get-children article-meta 'self-uri)))
  (loop for uri in uris
	with url = nil
	do
	(setq url (cdaadr uri))
	collect (cons (file-name-nondirectory url)
		      url)))
 #+END_SRC

 #+RESULTS:
 #+BEGIN_SRC emacs-lisp
(("m9.figshare.2070013.v1" . "10.6084/m9.figshare.2070013.v1")
 ("2070013" . "https://figshare.com/articles/kitchingroup_59/2070013")
 ("kitchingroup59.el" . "https://s3-eu-west-1.amazonaws.com/pfigshare-u-files/3698581/kitchingroup59.el")
 ("manuscript.org" . "https://s3-eu-west-1.amazonaws.com/pfigshare-u-files/3698584/manuscript.org")
 ("manuscript.pdf" . "https://s3-eu-west-1.amazonaws.com/pfigshare-u-files/3698587/manuscript.pdf")
 ("README.org" . "https://s3-eu-west-1.amazonaws.com/pfigshare-u-files/3698593/README.org")
 ("references.bib" . "https://s3-eu-west-1.amazonaws.com/pfigshare-u-files/3698590/references.bib")
 ("shorttitles.bib" . "https://s3-eu-west-1.amazonaws.com/pfigshare-u-files/3698596/shorttitles.bib")
 ("supportinginformation.org" . "https://s3-eu-west-1.amazonaws.com/pfigshare-u-files/3698599/supportinginformation.org")
 ("supportinginformation.pdf" . "https://s3-eu-west-1.amazonaws.com/pfigshare-u-files/3698602/supportinginformation.pdf")
 ("FIG1.eps" . "https://s3-eu-west-1.amazonaws.com/pfigshare-u-files/3698605/FIG1.eps")
 ("FIG1.png" . "https://s3-eu-west-1.amazonaws.com/pfigshare-u-files/3698608/FIG1.png")
 ("FIG2.eps" . "https://s3-eu-west-1.amazonaws.com/pfigshare-u-files/3698611/FIG2.eps")
 ("FIG2.png" . "https://s3-eu-west-1.amazonaws.com/pfigshare-u-files/3698614/FIG2.png")
 ("FIG3.eps" . "https://s3-eu-west-1.amazonaws.com/pfigshare-u-files/3698617/FIG3.eps")
 ("FIG3.png" . "https://s3-eu-west-1.amazonaws.com/pfigshare-u-files/3698620/FIG3.png")
 ("FIG4.eps" . "https://s3-eu-west-1.amazonaws.com/pfigshare-u-files/3698623/FIG4.eps")
 ("FIG4.png" . "https://s3-eu-west-1.amazonaws.com/pfigshare-u-files/3698626/FIG4.png")
 ("TOC.eps" . "https://s3-eu-west-1.amazonaws.com/pfigshare-u-files/3698629/TOC.eps")
 ("TOC.png" . "https://s3-eu-west-1.amazonaws.com/pfigshare-u-files/3698632/TOC.png")
 ("data.json" . "https://s3-eu-west-1.amazonaws.com/pfigshare-u-files/3698635/data.json")
 ("dos_data.py" . "https://s3-eu-west-1.amazonaws.com/pfigshare-u-files/3698638/dos_data.py"))
 #+END_SRC



 ((m9.figshare.2070013.v1 . 10.6084/m9.figshare.2070013.v1) (2070013 . https://figshare.com/articles/kitchingroup_59/2070013) (kitchingroup59.el . https://s3-eu-west-1.amazonaws.com/pfigshare-u-files/3698581/kitchingroup59.el) (manuscript.org . https://s3-eu-west-1.amazonaws.com/pfigshare-u-files/3698584/manuscript.org) (manuscript.pdf . https://s3-eu-west-1.amazonaws.com/pfigshare-u-files/3698587/manuscript.pdf) (README.org . https://s3-eu-west-1.amazonaws.com/pfigshare-u-files/3698593/README.org) (references.bib . https://s3-eu-west-1.amazonaws.com/pfigshare-u-files/3698590/references.bib) (shorttitles.bib . https://s3-eu-west-1.amazonaws.com/pfigshare-u-files/3698596/shorttitles.bib) (supportinginformation.org . https://s3-eu-west-1.amazonaws.com/pfigshare-u-files/3698599/supportinginformation.org) (supportinginformation.pdf . https://s3-eu-west-1.amazonaws.com/pfigshare-u-files/3698602/supportinginformation.pdf) (FIG1.eps . https://s3-eu-west-1.amazonaws.com/pfigshare-u-files/3698605/FIG1.eps) (FIG1.png . https://s3-eu-west-1.amazonaws.com/pfigshare-u-files/3698608/FIG1.png) (FIG2.eps . https://s3-eu-west-1.amazonaws.com/pfigshare-u-files/3698611/FIG2.eps) (FIG2.png . https://s3-eu-west-1.amazonaws.com/pfigshare-u-files/3698614/FIG2.png) (FIG3.eps . https://s3-eu-west-1.amazonaws.com/pfigshare-u-files/3698617/FIG3.eps) (FIG3.png . https://s3-eu-west-1.amazonaws.com/pfigshare-u-files/3698620/FIG3.png) (FIG4.eps . https://s3-eu-west-1.amazonaws.com/pfigshare-u-files/3698623/FIG4.eps) (FIG4.png . https://s3-eu-west-1.amazonaws.com/pfigshare-u-files/3698626/FIG4.png) (TOC.eps . https://s3-eu-west-1.amazonaws.com/pfigshare-u-files/3698629/TOC.eps) (TOC.png . https://s3-eu-west-1.amazonaws.com/pfigshare-u-files/3698632/TOC.png) (data.json . https://s3-eu-west-1.amazonaws.com/pfigshare-u-files/3698635/data.json) (dos_data.py . https://s3-eu-west-1.amazonaws.com/pfigshare-u-files/3698638/dos_data.py))
** Gdrive

 https://drive.google.com/file/d/0B67FYRNpJuqVYk1uNGJPOXhMSjQ/


 https://drive.google.com/uc?export=download&id=0B67FYRNpJuqVYk1uNGJPOXhMSjQ
